emacs-common/我是怎样使用Emacs的.org
#+TITLE: 我是怎样使用Emacs的
#+URL: http://mjwall.com/blog/2013/10/04/how-i-use-emacs/                                                   
#+AUTHOR: lujun9972
#+CATEGORY: emacs-common
#+DATE: [2016-08-01 周一 11:35]
#+OPTIONS: ^:{}

一直以来都想写一篇关于我当前Emacs配置的文章来描述我是如何在Mac和Linux上使用Emacs的,即我的Emacs工作流. 我使用这套配置一年多了,一直以来这套配置都工作的很好,几乎不需要怎么调整. 我现在用的是Emacs24,但是这套配置对更早些版本的Emacs也适用.

首先,我需要解释一下我是怎么工作的,以及我希望我的Emacs工作流能达到什么效果. 我大多数时候用的都是命令行,随机在终端或者Emacs的eshell中运行. 当然长时间的tail日志或者ssh操作可能导致Emacs崩溃因此这类操作我一般不在eshell中进行.
我之前用过很长一段时间点额vim,我习惯于快速打开一个文件,做一些修改,然后再关闭这个文件. 但是我也确实发现在Emacs中同时打开多个文件也很有用. Emacs daemon似乎能够满足这两种模式,但是我不喜欢在我登录系统或启动Emacs时自动启动该功能.

Avdi Grimm 曾经写过 [[http://devblog.avdi.org/2011/10/27/running-emacs-as-a-server-emacs-reboot-15/][一篇文章关于他是如何运行Emacs的]]. 这篇文章給我以启示. 在这之前我不太常用emacsclient. 但随后我发现它的 =-a= 参数能自动启动daemon,正是我所需要的. Avdi就是使用该脚本来启动emacsclient并创建新frame的.
默认情况下,终端会挂起并等待你关闭Emacs,但是你可以給 =ec= 脚本(脚本内容在后面)传递 =-n= 参数,这会使得控制权立刻回到终端.

* My ‘Emacs Workflow’

我的工作流有点与众不同. 当在图形化的Emacs中打开一个文件的时候,我会编辑这个文件但不会去关闭它. 然后我经常会再回到终端去运行命令处理那个新编辑过的文件(rake test或mvn packge). 这意味着终端运行emacsclient后不能一直在那等待emacsclient运行完毕.
若已经有一个图形化的emacs在运行,我希望能在这个emacs中编辑文件而不是重新打开一个新frame. 若有一个图形化的Emacs在运行但是处于最小化状态,则我希望最大化这个emacs然后用它打开文件.

对于一下快速编辑的情况,我希望在当前终端用Emacs快速打开文件,做出修改,然后关闭该文件. 这时终端应该等待直到我完成修改.

** Sidebar

#+BEGIN_QUOTE
    我在学会magit前都是使用这种快速编辑的方法来提交git commit的. 若你没有用过magit,我强烈推荐你花点时间学习它. 参加 [[http://magit.github.io/magit/magit.html][http://magit.github.io/magit/magit.html]]. 这也是为什么我在 =~/.bashrc= 中添加了 =export editor=et= 的缘故了.
#+END_QUOTE
   
* Tools

最终,我写了两个脚本: =ec= 和 =et=. 前一个脚本会在图形化Emacs中打开emacsclient然后将控制权立即交回shell. 后一个会在当前终端打开emacs并等待我完成编辑.
由于两个脚本都是连接的同一个daemon,因此所有打开的文件对两者都是可见的. 两个脚本都会在daemon未启动的情况下自动启动daemon. 
=ec= 脚本还有一些额外的代码用来实现我工作流中所描述的那样将焦点切换到emacs上. 下面是脚本的内容,我已经加上了注释了.

