blog/2016/08/01/我是怎样使用emacs的/index.html

<div id="outline-container-org3d5f4e7" class="outline-3">
<h3 id="org3d5f4e7"><span class="section-number-3">2.1</span> ec</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">!/bin/</span><span style="color: #4f97d7; font-weight: bold;">bash</span><span style="color: #2aa1ae; background-color: #292e34;">                                                                      </span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">This script starts emacs daemon if it is not running, opens whatever file      </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">you pass in and changes the focus to emacs.  Without any arguments, it just    </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">opens the current buffer or *scratch* if nothing else is open.  The following  </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">example will open ~/.bashrc                                                    </span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">ec ~/.bashrc                                                                   </span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">You can also pass it multiple files, it will open them all.  Unbury-buffer     </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">will cycle through those files in order                                        </span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">The compliment to the script is et, which opens emacs in the terminal          </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">attached to a daemon                                                           </span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">If you want to execute elisp, pass in -e whatever.                             </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">You may also want to stop the output from returning to the terminal, like      </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">ec -e "(message \"Hello\")" &gt; /dev/null                                        </span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">emacsclient options for reference                                              </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-a "" starts emacs daemon and reattaches                                       </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-c creates a new frame                                                         </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-n returns control back to the terminal                                        </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-e eval the script                                                             </span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Number of current visible frames,                                              </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Emacs daemon always has a visible frame called F1                              </span>
<span style="color: #bc6ec5; font-weight: bold;">visible_frames</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>                                                               
  emacsclient -a <span style="color: #2d9574;">""</span> -e <span style="color: #2d9574;">'(length (visible-frame-list))'</span>                           
<span style="color: #4f97d7;">}</span>                                                                                

<span style="color: #bc6ec5; font-weight: bold;">change_focus</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>                                                                 
  emacsclient -n -e <span style="color: #2d9574;">"(select-frame-set-input-focus (selected-frame))"</span> &gt; /dev/null
<span style="color: #4f97d7;">}</span>                                                                                

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">try switching to the frame incase it is just minimized                         </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">will start a server if not running                                             </span>
<span style="color: #4f97d7;">test</span> <span style="color: #2d9574;">"$(</span><span style="color: #fa8072;">visible_frames</span><span style="color: #2d9574;">)"</span> -eq <span style="color: #2d9574;">"1"</span> &amp;&amp; change_focus                                 

<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">[</span> <span style="color: #2d9574;">"$(</span><span style="color: #fa8072;">visible_frames</span><span style="color: #2d9574;">)"</span> -lt  <span style="color: #2d9574;">"2"</span> <span style="color: #4f97d7;">]</span>; <span style="color: #4f97d7; font-weight: bold;">then</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">need to create a frame               </span>
  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-c $@ with no args just opens the scratch buffer                             </span>
  emacsclient -n -c <span style="color: #2d9574;">"$@"</span> &amp;&amp; change_focus                                         
<span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">there is already a visible frame besides the daemon, so                   </span>
  change_focus                                                                   
  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-n $@ errors if there are no args                                            </span>
  <span style="color: #4f97d7;">test</span>  <span style="color: #2d9574;">"$#"</span> -ne <span style="color: #2d9574;">"0"</span> &amp;&amp; emacsclient -n <span style="color: #2d9574;">"$@"</span>                                      
<span style="color: #4f97d7; font-weight: bold;">fi</span>                                                                               
</pre>
</div>
</div>
</div>
