emacs-common/我是怎样使用Emacs的.org
** et

#+BEGIN_SRC sh
  #!/bin/bash                                                          
                                                                     
  # Makes sure emacs daemon is running and opens the file in Emacs in  
  # the terminal.                                                      
                                                                     
  # If you want to execute elisp, use -e whatever, like so             
                                                                     
  # et -e "(message \"Word up\")"                                      
                                                                     
  # You may want to redirect that to /dev/null if you don't want the   
  # return to printed on the terminal.  Also, just echoing a message   
  # may not be visible if Emacs then gives you a message about what    
  # to do when do with the frame                                       
                                                                     
  # The compliment to this script is ec                                
                                                                     
  # Emacsclient option reference                                       
  # -a "" starts emacs daemon and reattaches                           
  # -t starts in terminal, since I won't be using the gui              
  # can also pass in -n if you want to have the shell return right away
                                                                     
  exec emacsclient -a "" -t "$@"                                       
#+END_SRC

* Github repo

可以在[[https://github.com/mjwall/dotfiles][https://github.com/mjwall/dotfiles]] 中找到这两个脚本以及在Mac和Linux下安装Emacs的方法. 该仓库存放的其实是我的 =~/.emac.d= 配置. 我把所有的东西都放在一起,这样便于在新机器上重建配置,也便于在多态机器之间同步配置.

** Warning

#+BEGIN_QUOTE
    若你用的是Mac,请务必保证新版本的emacs和emacsclient被放在了正确的路径中. 可以去[[https://gist.github.com/mjwall/3fe935a8becb60dd3c4c][gist]] 上看看我是怎么做的. 当然肯定还有其他更好的实现方式吧.
#+END_QUOTE
   
* Bonus, executing elisp

我使用这两个脚本的另一种方式是使用 =-e= 选项来执行elisp代码. 例如,我就在我的bashrc中为magit设置了一个alias. 由于用到了这两个脚本因此它也能自动启动daemon并自动捕获焦点. 下面是定义alias的方法

#+BEGIN_SRC emacs-lisp
  alias magit='ec -e "(magit-status \"$(pwd)\")"' 
#+END_SRC

这样在终端中运行magit就会调用Emacs并在当前目录下运行magit-status了. This was inspired by a similiar tweet somewhere, but takes advantage of the rest of the ec script.

* Stopping the Daemon

最后还有一个脚本用于关闭daemon,这个脚本常用于重新加载emacs配置. 有时我的Mac在关机时会挂起等待Emacs退出,因此我一般都是先手工运行该脚本关闭Emacs. 脚本内容如下:

** es

#+BEGIN_SRC sh
  #!/bin/bash                                                                  
                                                                             
  # simple script to shutdown the running Emacs daemon                         
                                                                             
  # emacsclient options for reference                                          
  # -a Alternate editor, runs bin/false in this case                           
  # -e eval the script                                                         
                                                                             
  # If the server-process is bound and the server is in a good state, then kill
  # the server                                                                 
                                                                             
  server_ok() {                                                                
    emacsclient -a "false" -e "(boundp 'server-process)"                       
  }                                                                            
                                                                             
  if [ "t" == "$(server_ok)" ]; then                                           
    echo "Shutting down Emacs server"                                          
    # wasn't removing emacs from ALT-TAB on mac                                
    # emacsclient -e "(server-force-delete)"                                   
    emacsclient -e '(kill-emacs)'                                              
  else                                                                         
    echo "Emacs server not running"                                            
  fi                                                                           
#+END_SRC

似乎有很好的方法能解决Mac关机挂起的问题,但这个问题对我来说不是什么大问题,因此我没有深入这个问题.

