blog/2016/08/01/我是怎样使用emacs的/index.html

<div id="outline-container-org0ac9550" class="outline-3">
<h3 id="org0ac9550"><span class="section-number-3">2.2</span> et</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">!/bin/</span><span style="color: #4f97d7; font-weight: bold;">bash</span><span style="color: #2aa1ae; background-color: #292e34;">                                                          </span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Makes sure emacs daemon is running and opens the file in Emacs in  </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">the terminal.                                                      </span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">If you want to execute elisp, use -e whatever, like so             </span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">et -e "(message \"Word up\")"                                      </span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">You may want to redirect that to /dev/null if you don't want the   </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">return to printed on the terminal.  Also, just echoing a message   </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">may not be visible if Emacs then gives you a message about what    </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">to do when do with the frame                                       </span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">The compliment to this script is ec                                </span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Emacsclient option reference                                       </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-a "" starts emacs daemon and reattaches                           </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-t starts in terminal, since I won't be using the gui              </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">can also pass in -n if you want to have the shell return right away</span>

<span style="color: #4f97d7; font-weight: bold;">exec</span> emacsclient -a <span style="color: #2d9574;">""</span> -t <span style="color: #2d9574;">"$@"</span>                                       
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5d27a86" class="outline-2">
<h2 id="org5d27a86"><span class="section-number-2">3</span> Github repo</h2>
<div class="outline-text-2" id="text-3">
<p>
可以在<a href="https://github.com/mjwall/dotfiles">https://github.com/mjwall/dotfiles</a> 中找到这两个脚本以及在Mac和Linux下安装Emacs的方法. 该仓库存放的其实是我的 <code>~/.emac.d</code> 配置. 我把所有的东西都放在一起,这样便于在新机器上重建配置,也便于在多态机器之间同步配置.
</p>
</div>

<div id="outline-container-orgf8ccff8" class="outline-3">
<h3 id="orgf8ccff8"><span class="section-number-3">3.1</span> Warning</h3>
<div class="outline-text-3" id="text-3-1">
<blockquote>
<p>
若你用的是Mac,请务必保证新版本的emacs和emacsclient被放在了正确的路径中. 可以去<a href="https://gist.github.com/mjwall/3fe935a8becb60dd3c4c">gist</a> 上看看我是怎么做的. 当然肯定还有其他更好的实现方式吧.
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-orgdfd1019" class="outline-2">
<h2 id="orgdfd1019"><span class="section-number-2">4</span> Bonus, executing elisp</h2>
<div class="outline-text-2" id="text-4">
<p>
我使用这两个脚本的另一种方式是使用 <code>-e</code> 选项来执行elisp代码. 例如,我就在我的bashrc中为magit设置了一个alias. 由于用到了这两个脚本因此它也能自动启动daemon并自动捕获焦点. 下面是定义alias的方法
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">alias magit='ec -e <span style="color: #2d9574;">"(magit-status \"$(pwd)\")"</span>' 
</pre>
</div>

<p>
这样在终端中运行magit就会调用Emacs并在当前目录下运行magit-status了. This was inspired by a similiar tweet somewhere, but takes advantage of the rest of the ec script.
</p>
</div>
</div>

<div id="outline-container-org6ade3fb" class="outline-2">
<h2 id="org6ade3fb"><span class="section-number-2">5</span> Stopping the Daemon</h2>
<div class="outline-text-2" id="text-5">
<p>
最后还有一个脚本用于关闭daemon,这个脚本常用于重新加载emacs配置. 有时我的Mac在关机时会挂起等待Emacs退出,因此我一般都是先手工运行该脚本关闭Emacs. 脚本内容如下:
</p>
</div>

<div id="outline-container-org7243559" class="outline-3">
<h3 id="org7243559"><span class="section-number-3">5.1</span> es</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">!/bin/</span><span style="color: #4f97d7; font-weight: bold;">bash</span><span style="color: #2aa1ae; background-color: #292e34;">                                                                  </span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">simple script to shutdown the running Emacs daemon                         </span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">emacsclient options for reference                                          </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-a Alternate editor, runs bin/false in this case                           </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">-e eval the script                                                         </span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">If the server-process is bound and the server is in a good state, then kill</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">the server                                                                 </span>

<span style="color: #bc6ec5; font-weight: bold;">server_ok</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>                                                                
  emacsclient -a <span style="color: #2d9574;">"false"</span> -e <span style="color: #2d9574;">"(boundp 'server-process)"</span>                       
<span style="color: #4f97d7;">}</span>                                                                            

<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">[</span> <span style="color: #2d9574;">"t"</span> == <span style="color: #2d9574;">"$(</span><span style="color: #fa8072;">server_ok</span><span style="color: #2d9574;">)"</span> <span style="color: #4f97d7;">]</span>; <span style="color: #4f97d7; font-weight: bold;">then</span>                                           
  <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"Shutting down Emacs server"</span>                                          
  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">wasn't removing emacs from ALT-TAB on mac                                </span>
  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">emacsclient -e "(server-force-delete)"                                   </span>
  emacsclient -e <span style="color: #2d9574;">'(kill-emacs)'</span>                                              
<span style="color: #4f97d7; font-weight: bold;">else</span>                                                                         
  <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"Emacs server not running"</span>                                            
<span style="color: #4f97d7; font-weight: bold;">fi</span>                                                                           
</pre>
</div>

<p>
似乎有很好的方法能解决Mac关机挂起的问题,但这个问题对我来说不是什么大问题,因此我没有深入这个问题.
</p>
</div>
</div>
</div>
